---
type: HemisphericalLightDistribution
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 2
tags: [revit-api, class]
---

# HemisphericalLightDistribution

`Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | HemisphericalLightDistribution | — | `` |
| Constructor | HemisphericalLightDistribution | 2013 | `public HemisphericalLightDistribution ()` |